app/Controllers/DataController.php

SELECT `data`.`id_data`, `data`.`id_project`, `data`.`id_kriteria`, `data`.`nama`, `kriteria`.`nama` as `kriteria`, `data`.`value`
FROM `data`
JOIN `kriteria` ON `kriteria`.`id_kriteria` = `data`.`id_kriteria`
WHERE `data`.`id_project` = '2'
ORDER BY `data`.`nama` ASC
SELECT `id_kriteria`
FROM `kriteria`
WHERE `id_project` = '2'
---
	public function show()
	{
		// if (!$this->request->isAJAX()) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'gagal mengambil data'], 400);
		// dd($this->request->getGet('id_project'));
		// if (!$this->validate([
		// 'id_project' => 'required|is_natural_no_zero',
		// ])) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Gagal Validasi !'], 400);
		// ])) return $this->setResponseFormat('json')->respond($this->validator->getErrors(), 400);
		// if (!isset($this->request->getGet('id_project')) || !is_int($this->request->getGet('id_project'))) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Gagal Validasi !'], 400);
		$dataModel = new DataModel();
		$kriteriaModel = new KriteriaModel();

		$result = $dataModel->select('data.id_data, data.id_project,data.id_kriteria,data.nama,kriteria.nama as kriteria,data.value')->join('kriteria', 'kriteria.id_kriteria = data.id_kriteria')->orderBy('data.nama', 'asc')->where(['data.id_project' => $this->request->getGet('id_project')])->findAll();
		$kriteria = $kriteriaModel->select('id_kriteria')->where(['id_project' => $this->request->getGet('id_project')])->findAll();

SELECT `id_project`, `id_kriteria`, `nama`, `value`
FROM `data`
WHERE `nama` = 'laptop q'
SELECT `id_kriteria`
FROM `kriteria`
WHERE `id_project` = '3'
---
	public function update()
	{
		if (!$this->request->isAJAX()) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Bad Request'], 400);
		if (!$this->validate([
			'id_project' => 'required|is_natural_no_zero',
			'old' => 'required|alpha_numeric_space|max_length[100]',
			'nama' => 'required|alpha_numeric_space|max_length[100]',
			'kriteria.*' => 'required|is_natural_no_zero',
			// ])) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Gagal Validasi !'], 400);
		])) return $this->setResponseFormat('json')->respond($this->validator->getErrors(), 400);

		$dataModel = new DataModel();
		$kriteriaModel = new KriteriaModel();
		$data = [
			'update' => [],
			'add' => [],
		];
		$dummy = [];
		$id_project = $this->request->getJsonVar('id_project');
		$old = preg_replace('/\s\s+/', ' ', trim($this->request->getJsonVar('old')));
		$nama = preg_replace('/\s\s+/', ' ', trim($this->request->getJsonVar('nama')));

		foreach ($this->request->getJsonVar('kriteria') as $i => $v) {
			array_push($dummy, ['id_project' => $id_project, 'id_kriteria' => $i, 'nama' => $nama, 'value' => $v]);
		}

		$result = $dataModel->select('id_project, id_kriteria, nama,value')->where(['nama' => $old])->findAll();
		$kriteria = $kriteriaModel->select('id_kriteria')->where(['id_project' => $this->request->getJsonVar('id_project')])->findAll();

UPDATE `data` SET `nama` = 'laptop q', `value` = '75'
WHERE `id_project` = '3'
AND `id_kriteria` = '9'
AND `nama` = 'laptop q'
---
		$db->transBegin();
		if (!empty($data['update'])) {
			foreach ($data['update'] as $i => $v) {
				$dataModel->where(['id_project' => $v['id_project'], 'id_kriteria' => $v['id_kriteria'], 'nama' => $old])->set(['nama' => $v['nama'], 'value' => $v['value']])->update();