app/Controllers/KriteriaController.php

	public function show()
	{
		if (!$this->request->isAJAX()) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Gagal Validasi Input'], 400);
		$project = $this->validate(['project' => 'is_natural_no_zero']) ? $this->request->getGet('project') : false;
		$kriteriaModel = new KriteriaModel();
		$result = $kriteriaModel->select('id_kriteria, nama,deskripsi,atribut, bobot')->where('id_project', $project)->findAll();
---
SELECT `id_kriteria`, `nama`, `deskripsi`, `atribut`, `bobot`
FROM `kriteria`
WHERE `id_project` = '2'

	public function update()
	{
		if (!$this->request->isAJAX()) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Bad Request'], 400);
		if (!$this->validate([
			'id_project' => 'required|is_natural_no_zero',
			'id_kriteria' => 'required|is_natural_no_zero',
			'nama' => 'required|alpha_numeric_space|max_length[100]',
			'deskripsi' => 'required|alpha_numeric_space|max_length[255]',
			'bobot' => 'required|is_natural_no_zero|less_than[101]',
			'atribut' => 'required|alpha',
		])) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Gagal Validasi !'], 400);
		$kriteriaModel = new KriteriaModel();
		$id_kriteria = $this->request->getJsonVar('id_kriteria');
		$id_project = $this->request->getJsonVar('id_project');
		// dd($this->request->getJSON(true));
		$data = [
			'nama' => preg_replace('/\s\s+/', ' ', trim($this->request->getJsonVar('nama'))),
			'deskripsi' => preg_replace('/\s\s+/', ' ', trim($this->request->getJsonVar('deskripsi'))),
			'bobot' => $this->request->getJsonVar('bobot'),
			'atribut' => preg_replace('/\s\s+/', ' ', trim($this->request->getJsonVar('atribut'))),
		];
		$result = $kriteriaModel->select('nama,deskripsi,atribut,bobot')->where(['id_kriteria' => $id_kriteria, 'id_project' => $id_project])->first();
		if (empty($result)) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'Bad Request'], 400);
		$data = array_diff_assoc($data, $result);
		if (empty($data)) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'tidak ada perubahan'], 400);
		if (isset($data['nama'])) {
			$result = $kriteriaModel->select('nama,deskripsi,atribut,bobot')->where('id_project', $id_project)->where('nama', $data['nama'])->first();
			if (!empty($result)) return $this->setResponseFormat('json')->respond(['status' => false, 'pesan' => 'kriteria sudah ada'], 409);
		}
		$result = $kriteriaModel->update($id_kriteria, $data);
---
SELECT `nama`, `deskripsi`, `atribut`, `bobot`
FROM `kriteria`
WHERE `id_kriteria` = '11'
AND `id_project` = '3'
 LIMIT 1
SELECT `nama`, `deskripsi`, `atribut`, `bobot`
FROM `kriteria`
WHERE `id_project` = '3'
AND `nama` = 'jarjit sigh'
 LIMIT 1
UPDATE `kriteria` SET `nama` = 'jarjit sigh', `updated_at` = '2022-05-07 12:40:50'
WHERE `kriteria`.`id_kriteria` IN ('11')