app/Controllers/ProjectController.php

SELECT `nama`, `id_project`, `deskripsi`, `metode`
FROM `project`
---
	public function show()
	{
		$projectModel = new ProjectModel();
		$result = $projectModel->select('nama,id_project,deskripsi,metode')->findAll();