app/Controllers/ViewsController.php

	public function data()
	{
		if (!$this->validate([
			'project' => 'required|is_natural_no_zero',
		])) return redirect()->route('view_project');

		$kriteriaModel = new KriteriaModel();
		$id_project = $this->request->getGet('project');
		$result = $kriteriaModel->select('nama,id_kriteria')->where(['id_project' => $id_project])->findAll();
---
SELECT `nama`, `id_kriteria`
FROM `kriteria`
WHERE `id_project` = '2'

	public function hasil()
	{
		if (!$this->validate([
			'project' => 'required|is_natural_no_zero',
		])) {
			dd('gagal');
		}

		$projectModel = new ProjectModel();
		$dataModel = new DataModel();
		$kriteriaModel = new KriteriaModel();

		$id_project = $this->request->getGet('project');
		$result = $projectModel->where('id_project', $id_project)->first();
		if (empty($result)) {
			return view('hasil', ['page' => 'hasil', 'id_project' => $id_project, 'gagal' => 'tidak ada project']);
		}

		$db = [
			'kriteria' => [],
			'data' => [],
			'response' => []
		];

		$db['data'] = $dataModel->select('data.id_data, data.id_project,data.id_kriteria,data.nama,kriteria.nama as kriteria,data.value')->join('kriteria', 'kriteria.id_kriteria = data.id_kriteria')->orderBy('data.nama', 'asc')->where(['data.id_project' => $id_project])->findAll();
---
SELECT *
FROM `project`
WHERE `id_project` = '2'
 LIMIT 1
SELECT `data`.`id_data`, `data`.`id_project`, `data`.`id_kriteria`, `data`.`nama`, `kriteria`.`nama` as `kriteria`, `data`.`value`
FROM `data`
JOIN `kriteria` ON `kriteria`.`id_kriteria` = `data`.`id_kriteria`
WHERE `data`.`id_project` = '2'
ORDER BY `data`.`nama` ASC